remote-home/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/bench.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f26a8ad4a60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-dd176fb4-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 22:13:11 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [02:25<00:00, 72.85s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [03:31<00:00, 70.35s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  211.06    
Total input tokens:                      19847     
Total generated tokens:                  3072      
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         14.55     
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          108.59    
---------------Time to First Token----------------
Mean TTFT (ms):                          1428.03   
Median TTFT (ms):                        1611.26   
P50 TTFT (ms):                           1611.26   
P95 TTFT (ms):                           1611.85   
P99 TTFT (ms):                           1611.90   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          67.11     
Median TPOT (ms):                        67.11     
P50 TPOT (ms):                           67.11     
P95 TPOT (ms):                           67.13     
P99 TPOT (ms):                           67.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.05     
Median ITL (ms):                         67.09     
P50 ITL (ms):                            67.09     
P95 ITL (ms):                            67.71     
P99 ITL (ms):                            68.27     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          70086.07  
Median E2EL (ms):                        70253.13  
P50 E2EL (ms):                           70253.13  
P95 E2EL (ms):                           70263.02  
P99 E2EL (ms):                           70263.89  
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fc31dd50a60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-c3d64a1a-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 22:19:36 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [02:23<00:00, 71.56s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [03:34<00:00, 71.60s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  214.80    
Total input tokens:                      38677     
Total generated tokens:                  3072      
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         14.30     
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          194.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          2705.65   
Median TTFT (ms):                        2928.94   
P50 TTFT (ms):                           2928.94   
P95 TTFT (ms):                           3038.54   
P99 TTFT (ms):                           3048.28   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          67.08     
Median TPOT (ms):                        67.09     
P50 TPOT (ms):                           67.09     
P95 TPOT (ms):                           67.09     
P99 TPOT (ms):                           67.09     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.02     
Median ITL (ms):                         67.06     
P50 ITL (ms):                            67.06     
P95 ITL (ms):                            67.60     
P99 ITL (ms):                            68.19     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          71331.62  
Median E2EL (ms):                        71544.78  
P50 E2EL (ms):                           71544.78  
P95 E2EL (ms):                           71665.29  
P99 E2EL (ms):                           71676.00  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f904e1cca60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-200c689c-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 22:26:02 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [02:25<00:00, 72.97s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [03:40<00:00, 73.38s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  220.14    
Total input tokens:                      64238     
Total generated tokens:                  3072      
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         13.95     
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          305.76    
---------------Time to First Token----------------
Mean TTFT (ms):                          4468.68   
Median TTFT (ms):                        4435.33   
P50 TTFT (ms):                           4435.33   
P95 TTFT (ms):                           4621.74   
P99 TTFT (ms):                           4638.31   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          67.10     
Median TPOT (ms):                        67.09     
P50 TPOT (ms):                           67.09     
P95 TPOT (ms):                           67.11     
P99 TPOT (ms):                           67.12     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.03     
Median ITL (ms):                         67.08     
P50 ITL (ms):                            67.08     
P95 ITL (ms):                            67.61     
P99 ITL (ms):                            68.31     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          73110.92  
Median E2EL (ms):                        73064.27  
P50 E2EL (ms):                           73064.27  
P95 E2EL (ms):                           73258.87  
P99 E2EL (ms):                           73276.16  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/results/4-8K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_221245_candidate_flashattn_rocm_cuseq_all3/results/16-32K_throughput/result.json